Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
        <register>
          <name>FC6FCLKSEL</name>
          <description>LP_FLEXCOMM6 Clock Source Select</description>
          <addressOffset>0x8C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM6 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM6 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC7FCLKSEL</name>
          <description>LP_FLEXCOMM7 Clock Source Select</description>
          <addressOffset>0x8E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM7 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM7 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC8FCLKSEL</name>
          <description>LP_FLEXCOMM8 Clock Source Select</description>
          <addressOffset>0x908</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM8 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM8 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC9FCLKSEL</name>
          <description>LP_FLEXCOMM9 Clock Source Select</description>
          <addressOffset>0x928</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM9 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM9 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC10FCLKSEL</name>
          <description>LP_FLEXCOMM10 Clock Source Select</description>
          <addressOffset>0x948</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM10 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM10 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC11FCLKSEL</name>
          <description>LP_FLEXCOMM11 Clock Source Select</description>
          <addressOffset>0x968</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM11 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM11 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC12FCLKSEL</name>
          <description>LP_FLEXCOMM12 Clock Source Select</description>
          <addressOffset>0x988</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM12 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM12 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC13FCLKSEL</name>
          <description>LP_FLEXCOMM13 Clock Source Select</description>
          <addressOffset>0x9A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fcclk0</name>
                  <description>fcclk0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk1</name>
                  <description>fcclk1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk2</name>
                  <description>fcclk2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fcclk3</name>
                  <description>fcclk3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for LP_FLEXCOMM13 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for LP_FLEXCOMM13 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI012FCLKSEL</name>
          <description>SAI0, SAI1 and SAI2 Clock Source Select</description>
          <addressOffset>0x9C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>SAI0, SAI1 and SAI2 Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>baseclk_cmpt</name>
                  <description>baseclk_cmpt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro2_div8</name>
                  <description>fro2_div8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro0_max</name>
                  <description>fro0_max</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_clk_cmpt</name>
                  <description>audio_clk_cmpt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for SAI0, SAI1 and SAI2 clocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for SAI0, SAI1 and SAI2 clocks.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
