Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
        <register>
          <name>OTP_SHADOW_PARTB205</name>
          <description>OTP shadow register</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB206</name>
          <description>OTP shadow register</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB207</name>
          <description>OTP shadow register</description>
          <addressOffset>0x33C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB208</name>
          <description>OTP shadow register</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB209</name>
          <description>OTP shadow register</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB210</name>
          <description>OTP shadow register</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB211</name>
          <description>OTP shadow register</description>
          <addressOffset>0x34C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB212</name>
          <description>OTP shadow register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB213</name>
          <description>OTP shadow register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB214</name>
          <description>OTP shadow register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB215</name>
          <description>OTP shadow register</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB216</name>
          <description>OTP shadow register</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB217</name>
          <description>OTP shadow register</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB218</name>
          <description>OTP shadow register</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB219</name>
          <description>OTP shadow register</description>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB220</name>
          <description>OTP shadow register</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB221</name>
          <description>OTP shadow register</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB222</name>
          <description>OTP shadow register</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB223</name>
          <description>OTP shadow register</description>
          <addressOffset>0x37C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB224</name>
          <description>OTP shadow register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB225</name>
          <description>OTP shadow register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB226</name>
          <description>OTP shadow register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB227</name>
          <description>OTP shadow register</description>
          <addressOffset>0x38C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB228</name>
          <description>OTP shadow register</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB229</name>
          <description>OTP shadow register</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB230</name>
          <description>OTP shadow register</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB231</name>
          <description>OTP shadow register</description>
          <addressOffset>0x39C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB232</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB233</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB234</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB235</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB236</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB237</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB238</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
