Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="I3C0">
      <name>I3C1</name>
      <description>Improved Inter-Integrated Circuit</description>
      <groupName>I3C</groupName>
      <baseAddress>0x40038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I3C1</name>
        <value>54</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>RSTCTL3</name>
      <description>RSTCTL3</description>
      <groupName>RSTCTL3</groupName>
      <baseAddress>0x40060000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SYSRSTSTAT</name>
          <description>System Reset Status</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>VDD_POR</name>
              <description>VDD Power-On Reset (POR)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD_POR_EVENT_IS_NOT_DETECTED</name>
                  <description>No VDD POR event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD_POR_EVENT_WAS_DETECTED</name>
                  <description>VDD POR event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETN_RESET</name>
              <description>RESETN Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAD_RESET_IS_NOT_DETECTED</name>
                  <description>No RESETN event is detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_RESET_WAS_DETECTED</name>
                  <description>RESETN event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISP_AP_RESET</name>
              <description>ISP_AP (Debug Mailbox) Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ISP_RESET_IS_NOT_DETECTED</name>
                  <description>No ISP_AP reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISP_RESET_WAS_DETECTED</name>
                  <description>ISP_AP reset is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITRC_SW_RESET</name>
              <description>ITRC_SW (Intrusion and Tamper Response Controller SW) Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITRC_SW_RESET_IS_NOT_DETECTED</name>
                  <description>No ITRC_SW reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITRC_SW_RESET_WAS_DETECTED</name>
                  <description>ITRC_SW reset is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_RESET</name>
              <description>CPU0 Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_IS_NOT_DETECTED</name>
                  <description>No CPU0 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU0_WAS_DETECTED</name>
                  <description>CPU0 reset is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_RESET</name>
              <description>CPU1 Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_RESET_IS_NOT_DETECTED</name>
                  <description>No CPU1 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_RESET_WAS_DETECTED</name>
                  <description>CPU1 reset is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT0_RESET</name>
              <description>WWDT0 Reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WWDT0_RESET_IS_NOT_DETECTED</name>
                  <description>No WWDT0 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WWDT0_RESET_WAS_DETECTED</name>
                  <description>WWDT0 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT1_RESET</name>
              <description>WWDT1 Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WWDT1_RESET_IS_NOT_DETECTED</name>
                  <description>No WWDT1 reset event is detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WWDT1_RESET_WAS_DETECTED</name>
                  <description>WWDT1 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT2_RESET</name>
              <description>WWDT2 Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WWDT2_RESET_IS_NOT_DETECTED</name>
                  <description>No WWDT2 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WWDT2_RESET_WAS_DETECTED</name>
                  <description>WWDT2 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT3_RESET</name>
              <description>WWDT3 Reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WWDT3_RESET_IS_NOT_DETECTED</name>
                  <description>No WWDT3 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WWDT3_RESET_WAS_DETECTED</name>
                  <description>WWDT3 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDOG0_RESET</name>
              <description>CDOG0 Reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDOG0_RESET_IS_NOT_DETECTED</name>
                  <description>No CDOG0 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDOG0_RESET_WAS_DETECTED</name>
                  <description>CDOG0 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDOG1_RESET</name>
              <description>CDOG1 Reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDOG1_RESET_IS_NOT_DETECTED</name>
                  <description>No CDOG1 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDOG1_RESET_WAS_DETECTED</name>
                  <description>CDOG1 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDOG2_RESET</name>
              <description>CDOG2 Reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDOG2_RESET_IS_NOT_DETECTED</name>
                  <description>No CDOG2 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDOG2_RESET_WAS_DETECTED</name>
                  <description>CDOG2 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDOG3_RESET</name>
              <description>CDOG3 Reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDOG3_RESET_IS_NOT_DETECTED</name>
                  <description>No CDOG3 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDOG3_RESET_WAS_DETECTED</name>
                  <description>CDOG3 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDOG4_RESET</name>
              <description>CDOG4 Reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDOG4_RESET_IS_NOT_DETECTED</name>
                  <description>No CDOG4 reset event is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDOG4_RESET_WAS_DETECTED</name>
                  <description>CDOG4 reset event is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOMRSTSTAT</name>
          <description>Domain Reset Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDD1_SENSE_STAT</name>
              <description>VDD1_SENSE Domain Reset State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD1_SENSE_STAT_0</name>
                  <description>The domain is in reset state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD1_SENSE_STAT_1</name>
                  <description>The domain is in normal run state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM2_STAT</name>
              <description>VDD2_COM (Main) Domain Reset State</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COM2_STAT_0</name>
                  <description>The domain is in reset state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COM2_STAT_1</name>
                  <description>The domain is in normal run state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMN_STAT</name>
              <description>VDDN_COM Domain Reset State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMN_STAT_0</name>
                  <description>The domain is in reset state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMN_STAT_1</name>
                  <description>The domain is in normal run state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_STAT</name>
              <description>VDD2_COMP Domain Reset State</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_STAT_0</name>
                  <description>The domain is in reset state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_STAT_1</name>
                  <description>The domain is in normal run state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP_STAT</name>
              <description>VDD2_DSP Domain Reset State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSP_STAT_0</name>
                  <description>The domain is in reset state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_STAT_1</name>
                  <description>The domain is in normal run state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEDIA_STAT</name>
              <description>VDD2_MEDIA Domain Reset State</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEDIA_STAT_0</name>
                  <description>The domain is in reset state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIA_STAT_1</name>
                  <description>The domain is in normal run state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL0</name>
          <description>Sense Domain Peripheral Reset Control 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IOPCTL1</name>
              <description>IOPCTL1 Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOPCTL1_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOPCTL1_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1</name>
              <description>CPU1 Reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
