Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>OSC32KNP</name>
      <description>Nano Power 32 kHz Oscillator</description>
      <groupName>OSC32KNP</groupName>
      <baseAddress>0x40063000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00080A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC_DIS</name>
              <description>Oscillator Output Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the oscillator output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the oscillator output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NANOPOWER</name>
                  <description>Low-Power (Nano-Power) mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHPOWER</name>
                  <description>High-Power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS_EN</name>
              <description>Bypass Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_TRIM</name>
              <description>Capacitor Trim Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAP_0</name>
                  <description>0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_1</name>
                  <description>2 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_2</name>
                  <description>4 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_3</name>
                  <description>6 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_4</name>
                  <description>8 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_5</name>
                  <description>10 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_6</name>
                  <description>12 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_7</name>
                  <description>14 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_8</name>
                  <description>16 pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_9</name>
                  <description>18 pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_10</name>
                  <description>20 pF</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_11</name>
                  <description>22 pF</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_12</name>
                  <description>24 pF</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_13</name>
                  <description>26 pF</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_14</name>
                  <description>28 pF</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_15</name>
                  <description>30 pF</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKMON_EN</name>
              <description>Clock Monitor Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Clock Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCXO_STABLE</name>
              <description>Startup Oscillator (TCXO) Stable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSTABLE</name>
                  <description>Unstable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABLE</name>
                  <description>Stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCXO_STABLE</name>
              <description>Self-Charge Oscillator (SCXO) Stable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSTABLE</name>
                  <description>Unstable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABLE</name>
                  <description>Stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_TAMPER_DETECTED</name>
              <description>Clock Tamper Detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_NO</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_YES</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
