Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>RSTCTL4</name>
      <description>RSTCTL4</description>
      <groupName>RSTCTL4</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PRSTCTL0</name>
          <description>Media Domain Peripheral Reset Control 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2F1FC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VGPU</name>
              <description>VGPU Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VGPU_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VGPU_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDIF</name>
              <description>LCDIF Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDIF_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIPI_DSI_HOST</name>
              <description>MIPI_DSI_HOST Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIPI_DSI_HOST_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIPI_DSI_HOST_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV</name>
              <description>EZHV Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JPEGDEC</name>
              <description>JPEGDEC Reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JPEGDEC_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JPEGDEC_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PNGDEC</name>
              <description>PNGDEC Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PNGDEC_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PNGDEC_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI2</name>
              <description>XSPI2 Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XSPI2_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XSPI2_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14</name>
              <description>LPSPI14 Reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI14_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI14_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16</name>
              <description>LPSPI16 Reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI16_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI16_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO0</name>
              <description>FLEXIO0 Reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO0_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL1</name>
          <description>Media Domain (Interface) Peripheral Reset Control 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB0</name>
              <description>USB0 Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB0_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPHY0</name>
              <description>USBPHY0 Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBPHY0_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBPHY0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB1</name>
              <description>USB1 Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB1_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB1_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>uSDHC0</name>
              <description>uSDHC0 Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>uSDHC0_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uSDHC0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>uSDHC1</name>
              <description>uSDHC1 Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>uSDHC1_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uSDHC1_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL0_SET</name>
          <description>Media Domain Peripheral Reset Control 0 SET</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VGPU</name>
              <description>VGPU Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VGPU_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VGPU_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDIF</name>
              <description>LCDIF Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDIF_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIPI_DSI_HOST</name>
              <description>MIPI_DSI_HOST Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIPI_DSI_HOST_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIPI_DSI_HOST_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV</name>
              <description>EZHV Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NO_Effect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JPEGDEC</name>
              <description>JPEGDEC Reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JPEGDEC_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JPEGDEC_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PNGDEC</name>
              <description>PNGDEC Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PNGDEC_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PNGDEC_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI2</name>
              <description>XSPI2 Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XSPI2_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XSPI2_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14</name>
              <description>LPSPI14 Reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI14_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI14_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16</name>
              <description>LPSPI16 Reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI16_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI16_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO0</name>
              <description>FLEXIO0 Reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO0_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL1_SET</name>
          <description>Media Domain (Interface) Peripheral Reset Control 1 SET</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB0</name>
              <description>USB0 Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB0_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPHY0</name>
              <description>USBPHY0 Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBPHY0_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBPHY0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB1</name>
              <description>USB1 Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB1_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB1_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>uSDHC0</name>
              <description>uSDHC0 Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>uSDHC0_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uSDHC0_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>uSDHC1</name>
              <description>uSDHC1 Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>uSDHC1_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>uSDHC1_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
