Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM1</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI1</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40111000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM1</name>
        <value>8</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM2</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI2</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40112000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM2</name>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM3</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI3</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40113000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM3</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM4</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI4</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40171000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM4</name>
        <value>11</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM5</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI5</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40172000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM5</name>
        <value>12</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM6</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI6</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40173000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM6</name>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM7</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI7</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40174000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM7</name>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM8</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI8</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x40199000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM8</name>
        <value>47</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM9</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI9</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x4019A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM9</name>
        <value>48</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM10</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI10</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x4019B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM10</name>
        <value>49</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM11</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI11</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x4019C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM11</name>
        <value>50</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM12</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI12</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x4019D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM12</name>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LP_FLEXCOMM0">
      <name>LP_FLEXCOMM13</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI13</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <baseAddress>0x4019E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM13</name>
        <value>52</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>LPI2C0</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <headerStructName>LPI2C</headerStructName>
      <baseAddress>0x40110800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM0</name>
        <value>7</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1030003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASTER_ONLY</name>
                  <description>Controller only, with standard feature set</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_AND_SLAVE</name>
                  <description>Controller and target, with standard feature set</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x303</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MTXFIFO</name>
              <description>Controller Transmit FIFO Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRXFIFO</name>
              <description>Controller Receive FIFO Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <description>Controller Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEN</name>
              <description>Controller Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Software Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_RESET</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEN</name>
              <description>Doze Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTF</name>
              <description>Reset Transmit FIFO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset transmit FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRF</name>
              <description>Reset Receive FIFO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset receive FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
