Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
        <register>
          <name>PPW_RDSR</name>
          <description>Page Program Wait Read Status</description>
          <addressOffset>0x4F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDSR</name>
              <description>Value of Flash Status Register Read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDSR_VAL_CHK</name>
              <description>RDSR Value Check</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVER_0</name>
                  <description>Check for 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVER_1</name>
                  <description>Check for 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDSR_HWORD_SEL</name>
              <description>RDSR Half Word Select</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>RDSR contains 16 least significant bits (15:0) of RDSR read from flash.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPPER</name>
                  <description>RDSR contains 16 most significant bits (31:16) of RDSR read from flash.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOC</name>
              <description>Location of RDSR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>IPEDCTXxIV[%s]</name>
          <description>IPEDCTXxIV array</description>
          <addressOffset>0x520</addressOffset>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1</dimIndex>
            <name>IPEDCTXIV%s</name>
            <description>IPED Context Initial Vector</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CTX_IV</name>
                <description>32 bits of IV for the context region</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IPEDCTXSTART</name>
            <description>IPED Start Address Region</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GCM</name>
                <description>GCM Mode Region</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOTGCM</name>
                    <description>CTR</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GCM</name>
                    <description>GCM</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SADD</name>
                <description>Start Address</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IPEDCTXEND</name>
            <description>IPED End Address Region</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>END_ADDRESS</name>
                <description>End Address</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1</dimIndex>
            <name>IPEDCTXAAD%s</name>
            <description>IPED Context Additional Authentication Data</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CTX_AAD</name>
                <description>32 bits of AAD for the region</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>IPEDCTRL</name>
          <description>IPED Function Control</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG</name>
              <description>IPED CTR/GCM Interface Configure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRINCE_12</name>
                  <description>Prince 12 rounds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRINCE_22</name>
                  <description>Prince 22 rounds</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPED_EN</name>
              <description>IPED CTR-GCM Interface Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSES</name>
                  <description>Bypasses IPED logic and allows writing of unencrypted or undecrypted data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLES</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPWR_EN</name>
              <description>IP Write IPED CTR Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>Bypasses IPS-based data and writes unencrypted data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBWR_EN</name>
              <description>AHB Write IPED CTR Mode Encryption Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>Bypasses AHB-based data and writes unencrypted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBRD_EN</name>
              <description>AHB Read IPED CTR Mode Decryption Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>Bypasses AHB-based data and reads unencrypted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPGCMWR</name>
              <description>IP Write GCM Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>Bypasses IPS-based data and writes unencrypted data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHGCMWR</name>
              <description>AHB Write IPED GCM Encryption Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>Bypasses AHB data and writes unencrypted data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBGCMRD</name>
              <description>AHB Read IPED GCM Decryption Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>Bypasses AHB data and reads unencrypted data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPED_PROTECT</name>
              <description>IPED Protection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLES</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLES</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPED_SWRESET</name>
              <description>IPED CTR/GCM Software Reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ABORT</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <description>Resets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPS_GCM</name>
              <description>IPS Transaction Region Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_GCM</name>
                  <description>Non-GCM region, either CTR or bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCM</name>
                  <description>GCM region</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IPEDCTXCTRL0</name>
          <description>IPED Context Control 0</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTX0_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX1_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX2_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX3_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX4_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX5_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX6_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX7_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX8_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX9_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX10_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX11_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX12_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX13_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX14_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTX15_FREEZE</name>
              <description>CTX Freeze</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
