Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="ELS">
      <name>ELS_ALIAS1</name>
      <description>no description available</description>
      <groupName>ELS</groupName>
      <baseAddress>0x40191000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="ELS">
      <name>ELS_ALIAS2</name>
      <description>no description available</description>
      <groupName>ELS</groupName>
      <baseAddress>0x40192000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="ELS">
      <name>ELS_ALIAS3</name>
      <description>no description available</description>
      <groupName>ELS</groupName>
      <baseAddress>0x40193000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>PUF</name>
      <description>PUF</description>
      <groupName>PUF</groupName>
      <headerStructName>PUF</headerStructName>
      <baseAddress>0x40194000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>45</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZEROIZE</name>
              <description>Zeroize operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_ZEROIZE</name>
                  <description>Does not begin zeroize operation (disabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_ZEROIZE</name>
                  <description>Begins the zeroize operation (enabled).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENROLL</name>
              <description>Enroll operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_ENROLL</name>
                  <description>Does not begin enroll operation (disabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_ENROLL</name>
                  <description>Begins the enroll operation (enabled).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_START</name>
                  <description>Does not begin start operation (disabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_START</name>
                  <description>Begins the start operation (enabled).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECONSTRUCT</name>
              <description>Reconstruct operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_RECONSTRUCT</name>
                  <description>Reconstruct operation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_RECONSTRUCT</name>
                  <description>Reconstruct operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_STOP</name>
                  <description>Stop operation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_STOP</name>
                  <description>Stop operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GET_KEY</name>
              <description>Get Key operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_GET_KEY</name>
                  <description>Get Key operation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_GET_KEY</name>
                  <description>Get Key operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNWRAP</name>
              <description>Unwrap operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_UNWRAP</name>
                  <description>Unwrap operation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_UNWRAP</name>
                  <description>Unwrap operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRAP_GENERATED_RANDOM</name>
              <description>Wrap Generated Random operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_WRAP_GENERATED_RANDOM</name>
                  <description>Wrap generated random operation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_WRAP_GENERATED_RANDOM</name>
                  <description>Wrap generated random operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRAP</name>
              <description>Wrap operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_WRAP</name>
                  <description>Wrap operation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_WRAP</name>
                  <description>Wrap operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENERATE_RANDOM</name>
              <description>Generate Random operation</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_GENERATE_RANDOM</name>
                  <description>Generate Random operation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_GENERATE_RANDOM</name>
                  <description>Generate Random operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_MEMORY</name>
              <description>Test memory operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Test memory operation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Test memory operation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_PUF</name>
              <description>Test PUF operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Test PUF operation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Test PUF operation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ORR</name>
          <description>Operation Result</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_CODE</name>
              <description>Result code of last operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OK</name>
                  <description>Indicates that the last operation was successful or operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT</name>
                  <description>Indicates that the AC is not for the current product/version.</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT_PH2</name>
                  <description>Indicates that the AC in the second phase is not for the current product/version.</description>
                  <value>0xF1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER</name>
                  <description>Indicates that the AC is corrupted.</description>
                  <value>0xF2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER_PH2</name>
                  <description>Indicates that the AC in the second phase is corrupted.</description>
                  <value>0xF3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH</name>
                  <description>Indicates that the authentication of the provided AC failed.</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH_PH2</name>
                  <description>Indicates that the authentication of the provided AC failed in the second phase.</description>
                  <value>0xF5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PUF_QUALITY</name>
                  <description>Indicates that the SRAM PUF quality verification fails.</description>
                  <value>0xF6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_CONTEXT</name>
                  <description>Indicates that the incorrect or unsupported context is provided.</description>
                  <value>0xF7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_DESTINATION</name>
                  <description>Indicates that a data destination was set that is not allowed according to other settings and the current PUF state.</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAILURE</name>
                  <description>Indicates that the PUF SRAM access has failed.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_OPERATION</name>
              <description>Last operation type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_PROGRESS</name>
                  <description>Indicates that the operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ENROLL</name>
                  <description>Indicates that the last operation was Enroll.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_START</name>
                  <description>Indicates that the last operation was Start.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_RECONSTRUCT</name>
                  <description>Indicates that the last operation was Reconstruct</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_STOP</name>
                  <description>Indicates that the last operation was Stop.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GET_KEY</name>
                  <description>Indicates that the last operation was Get Key.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_UNWRAP</name>
                  <description>Indicates that the last operation was Unwrap.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP_GEN_RND</name>
                  <description>Indicates that the last operation was Wrap Generated Random.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP</name>
                  <description>Indicates that the last operation was Wrap.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GEN_RND</name>
                  <description>Indicates that the last operation was Generate Random.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_MEMORY</name>
                  <description>Indicates that the last operation was Test Memory.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_PUF</name>
                  <description>Indicates that the last operation was Test PUF.</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_INITIALIZATION</name>
                  <description>Indicates that the last operation was Initialization.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ZEROIZE</name>
                  <description>Indicates that the last operation was Zeroize.</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
