Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
        <register>
          <name>CMDL15</name>
          <description>Command Low Buffer</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input Channel Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_CH0</name>
                  <description>Select CH0A or CH0B or CH0A/CH0B pair</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH1</name>
                  <description>Select CH1A or CH1B or CH1A/CH1B pair</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH2</name>
                  <description>Select CH2A or CH2B or CH2A/CH2B pair</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH3</name>
                  <description>Select CH3A or CH3B or CH3A/CH3B pair</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_4</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_5</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_6</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_7</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_8</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_9</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH30</name>
                  <description>Select CH30A or CH30B or CH30A/CH30B pair</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH31</name>
                  <description>Select CH31A or CH31B or CH31A/CH31B pair</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTYPE</name>
              <description>Conversion Type</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ENDED_A_SIDE_CHANNEL</name>
                  <description>Single-ended mode (only the A-side channel is converted)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ENDED_B_SIDE_CHANNEL</name>
                  <description>Single-ended mode (only the B-side channel is converted)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIFFERENTIAL_A_MINUS_B</name>
                  <description>Differential mode (A-B)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_A_AND_B</name>
                  <description>Dual-Single-Ended mode (both A-side and B-side channels are converted independently)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Select Resolution of Conversions</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_12_BITS</name>
                  <description>Standard resolution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_16_BITS</name>
                  <description>High resolution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTB_ADCH</name>
              <description>Alternate Channel B Input Channel Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_CH0B</name>
                  <description>Select CH0B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH1B</name>
                  <description>Select CH1B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH2B</name>
                  <description>Select CH2B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH3B</name>
                  <description>Select CH3B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_4</name>
                  <description>Select the corresponding channel CHnB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_5</name>
                  <description>Select the corresponding channel CHnB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_6</name>
                  <description>Select the corresponding channel CHnB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_7</name>
                  <description>Select the corresponding channel CHnB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_8</name>
                  <description>Select the corresponding channel CHnB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_9</name>
                  <description>Select the corresponding channel CHnB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH30B</name>
                  <description>Select CH30B</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH31B</name>
                  <description>Select CH31B</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTBEN</name>
              <description>Alternate Channel B Select Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDH15</name>
          <description>Command High Buffer</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAIT_TRIG</name>
              <description>Wait for Trigger Assertion Before Execution</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Execute automatically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Receive trigger before execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LWI</name>
              <description>Loop with Increment</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Sample Time Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_3p5</name>
                  <description>Minimum sample time of 3.5 ADCK cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5p5</name>
                  <description>3.5 + 21 ADCK cycles; 5.5 ADCK cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_7p5</name>
                  <description>3.5 + 22 ADCK cycles; 7.5 ADCK cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_11p5</name>
                  <description>3.5 + 23 ADCK cycles; 11.5 ADCK cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_19p5</name>
                  <description>3.5 + 24 ADCK cycles; 19.5 ADCK cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_35p5</name>
                  <description>3.5 + 25 ADCK cycles; 35.5 ADCK cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_67p5</name>
                  <description>3.5 + 26 ADCK cycles; 67.5 ADCK cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_131p5</name>
                  <description>3.5 + 27 ADCK cycles; 131.5 ADCK cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGS</name>
              <description>Hardware Average Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>Single conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_2</name>
                  <description>2 conversions</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_4</name>
                  <description>4 conversions</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_8</name>
                  <description>8 conversions</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_16</name>
                  <description>16 conversions</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_32</name>
                  <description>32 conversions</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_64</name>
                  <description>64 conversions</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_128</name>
                  <description>128 conversions</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_256</name>
                  <description>256 conversions</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_512</name>
                  <description>512 conversions</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024</name>
                  <description>1024 conversions</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop Count Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_EXEC_1x</name>
                  <description>Looping not enabled; command executes one time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_2x</name>
                  <description>Loop one time; command executes two times</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_3x</name>
                  <description>Loop two times; command executes three times</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_3</name>
                  <description>Loop corresponding number of times; command executes LOOP + 1 times</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_4</name>
                  <description>Loop corresponding number of times; command executes LOOP + 1 times</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_5</name>
                  <description>Loop corresponding number of times; command executes LOOP + 1 times</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_6</name>
                  <description>Loop corresponding number of times; command executes LOOP + 1 times</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_7</name>
                  <description>Loop corresponding number of times; command executes LOOP + 1 times</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_8</name>
                  <description>Loop corresponding number of times; command executes LOOP + 1 times</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXECUTES_CORRESPONDING_TIMES_9</name>
                  <description>Loop corresponding number of times; command executes LOOP + 1 times</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_EXEC_15x</name>
                  <description>Loop 15 times; command executes 16 times</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXT</name>
              <description>Next Command Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_NEXT_CMD_TERMINATE_ON_FINISH</name>
                  <description>No next command defined</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CMD1_NEXT</name>
                  <description>CMD1 command buffer register</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_2</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_3</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_4</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_5</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_6</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_7</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_8</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CORRESPONDING_CMD_NEXT_9</name>
                  <description>Corresponding CMD command buffer register</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DO_CMD15_NEXT</name>
                  <description>CMD15 command buffer register</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4</dimIndex>
          <name>CV%s</name>
          <description>Compare Value</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CVL</name>
              <description>Compare Value Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVH</name>
              <description>Compare Value High</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
