Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
        <register>
          <name>DECIMATOR_CTL_0</name>
          <description>Decimator Control 0</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POL_INV_P_ENABLE</name>
              <description>Polarity Inverter P Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POL_INV_DCP_3_DIS</name>
                  <description>Disables at Decimator_p[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POL_INV_DCP_3_EN</name>
                  <description>Enables at Decimator_p[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL_INV_N_ENABLE</name>
              <description>Polarity Inverter N Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POL_INV_DCN_3_DIS</name>
                  <description>Disables at Decimator_n[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POL_INV_DCN_3_EN</name>
                  <description>Enables at Decimator_n[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCFILTI_P_ENABLE</name>
              <description>Decimation Filter Input P Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCP_3_DIS</name>
                  <description>Disables at Decimator_p[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCP_3_EN</name>
                  <description>Enables at Decimator_p[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCFILTI_N_ENABLE</name>
              <description>Decimation Filter Input N Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCN_3_DIS</name>
                  <description>Disables at Decimator_n[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCN_3_EN</name>
                  <description>Enables at Decimator_n[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECIMATOR_CTL_1</name>
          <description>Decimator Control 1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC_LOCAL_RST_AN_DEC_P</name>
              <description>Functional Local Reset for Decimator P</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCP_3_RST</name>
                  <description>Reset for Decimator_p[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCP_3_OP</name>
                  <description>Operational for Decimator_p[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUNC_LOCAL_RST_AN_DEC_N</name>
              <description>Functional Local Reset for Decimator N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCN_3_RST</name>
                  <description>Reset for Decimator_n[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCN_3_OP</name>
                  <description>Operational for Decimator_n[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DECIMATOR_CTL_2</name>
          <description>Decimator Control 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOL_CTRL_P_0</name>
              <description>Volume Control P 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOL_CTRL_N_0</name>
              <description>Volume Control N 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOL_CTRL_P_1</name>
              <description>Volume Control P 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOL_CTRL_N_1</name>
              <description>Volume Control N 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DECIMATOR_CTL_3</name>
          <description>Decimator Control 3</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOL_CTRL_P_2</name>
              <description>Volume Control P 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOL_CTRL_N_2</name>
              <description>Volume Control N 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOL_CTRL_P_3</name>
              <description>Volume Control P 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOL_CTRL_N_3</name>
              <description>Volume Control N 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DECIMATOR_CTL_4</name>
          <description>Decimator Control 4</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET_SPEED_P_0</name>
              <description>Set Speed P 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_SPEED_N_0</name>
              <description>Set Speed N 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_SPEED_P_1</name>
              <description>Set Speed P 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_SPEED_N_1</name>
              <description>Set Speed N 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_SPEED_P_2</name>
              <description>Set Speed P 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_SPEED_N_2</name>
              <description>Set Speed N 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_SPEED_P_3</name>
              <description>Set Speed P 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_SPEED_N_3</name>
              <description>Set Speed N 3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_00</name>
                  <description>48 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_01</name>
                  <description>32 kHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_10</name>
                  <description>16 kHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SR_11</name>
                  <description>48 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_LOOP_CTL_0</name>
          <description>DC Loop Control 0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCLOOP_P_ENABLE</name>
              <description>DC Loop P Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_P3_DIS</name>
                  <description>Disables filter_p[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_P3_EN</name>
                  <description>Enables filter_p[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCLOOP_N_ENABLE</name>
              <description>DC Loop N Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_N3_DIS</name>
                  <description>Disables filter_n[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_N3_EN</name>
                  <description>Enables filter_n[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_LOOP_CTL_1</name>
          <description>DC Loop Control 1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC_LOCAL_RST_AN_DCLOOP_P</name>
              <description>Functional Local Reset DCloop_p</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P3_RST</name>
                  <description>Reset for ADCp[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_OP</name>
                  <description>Operational for ADCp[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUNC_LOCAL_RST_AN_DCLOOP_N</name>
              <description>Functional Local Reset DCloop_n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N3_RST</name>
                  <description>Reset for ADCn[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N3_OP</name>
                  <description>Operational for ADCn[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
