Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
        <register>
          <name>VAD0_CTRL_2</name>
          <description>Voice Activity Detector 0 Control</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADHPF</name>
              <description>High-Pass Filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>filt_bypass</name>
                  <description>Filter bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cutoff_1750Hz</name>
                  <description>Cut-off frequency at 1750 Hz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cutoff_215Hz</name>
                  <description>Cut-off frequency at 215 Hz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cutoff_102Hz</name>
                  <description>Cut-off frequency at 102 Hz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADINPGAIN</name>
              <description>Input Gain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VADINGAIN_0000</name>
                  <description>No shift</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_0001</name>
                  <description>Shift 1 bit to the left</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_0010</name>
                  <description>Shift 2 bits to the left</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_0011_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_0011_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_0011_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_0011_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_0111</name>
                  <description>Shift 7 bits to the left</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1000</name>
                  <description>Shift 8 bits to the right</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1001</name>
                  <description>Shift 7 bits to the right</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1010_10</name>
                  <description>...</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1010_11</name>
                  <description>...</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1010_12</name>
                  <description>...</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1010_13</name>
                  <description>...</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1010_14</name>
                  <description>...</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADINGAIN_1111</name>
                  <description>Shift 1 bits to the right</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADFRAMET</name>
              <description>Frame Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VADFRAMET_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_2</name>
                  <description>...</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_2_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADFRAMET_63</name>
                  <description>63</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADFOUTDIS</name>
              <description>Force Output Disable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>out_enabled</name>
                  <description>Enables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>out_disabled</name>
                  <description>Disables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADPREFEN</name>
              <description>Pre Filter Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bypassed</name>
                  <description>Pre-filter bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Pre-filter enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADFRENDIS</name>
              <description>Frame Energy Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD0_STAT</name>
          <description>Voice Activity Detector 0 Status</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADIF</name>
              <description>Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_detect</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>detect</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADINSATF</name>
              <description>Input Saturation Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADINITF</name>
              <description>Initialization Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_init</name>
                  <description>Not being initialized</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>init</name>
                  <description>Being initialized</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD0_SCONFIG</name>
          <description>Voice Activity Detector 0 Signal Configuration</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADSGAIN</name>
              <description>Signal Gain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VADSGAIN_0_0</name>
                  <description>Multiplier = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_0_1</name>
                  <description>Multiplier = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_2</name>
                  <description>Multiplier = 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_3_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_3_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_3_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_3_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_3_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_3_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_3_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADSGAIN_15</name>
                  <description>Multiplier = 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADSMAXEN</name>
              <description>Signal Maximum Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bypassed</name>
                  <description>Maximum block bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Maximum block enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADSFILEN</name>
              <description>Signal Filter Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
