Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_cm33_core0.xml
        <register>
          <name>VAD0_NCONFIG</name>
          <description>Voice Activity Detector 0 Noise Configuration</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADNGAIN</name>
              <description>Noise Gain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VADNGAIN_0_0</name>
                  <description>Multiplier = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_0_1</name>
                  <description>Multiplier = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_2</name>
                  <description>Multiplier = 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_3_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_3_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_3_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_3_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_3_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_3_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_3_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNGAIN_15</name>
                  <description>Multiplier = 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADNFILADJ</name>
              <description>Noise Filter Adjustment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VADNFILADJ_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_2</name>
                  <description>...</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_2_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADNFILADJ_31</name>
                  <description>31</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADNOREN</name>
              <description>Noise OR Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_decimated</name>
                  <description>Not decimated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>decimated</name>
                  <description>Decimated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADNDECEN</name>
              <description>Noise Decimation Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_decimated</name>
                  <description>Not decimated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>decimated</name>
                  <description>Decimated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADNMINEN</name>
              <description>Noise Minimum Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bypassed</name>
                  <description>Minimum block bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Minimum block enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADNFILAUTO</name>
              <description>Noise Filter Auto</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nf_always_en</name>
                  <description>Always enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nf_cond_en</name>
                  <description>Enabled or disabled based on voice activity information</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD0_NDATA</name>
          <description>Voice Activity Detector 0 Noise Data</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADNDATA</name>
              <description>Noise Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD0_ZCD</name>
          <description>Voice Activity Detector 0 Zero-Crossing Detector</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADZCDEN</name>
              <description>ZCD Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADZCDAUTO</name>
              <description>ZCD Automatic Threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_estimated</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>estimated</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADZCDAND</name>
              <description>ZCD AND Behavior</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ored</name>
                  <description>OR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>anded</name>
                  <description>AND</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADZCDADJ</name>
              <description>ZCD Adjustment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VADZCDADJ_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_2</name>
                  <description>...</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_2_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VADZCDADJ_15</name>
                  <description>15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADZCDTH</name>
              <description>ZCD Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
